# 行頭に # を書くと、プログラムとして処理されない文字列（コメントと呼ばれます）を書くことができます

# 次の名簿はある学校のあるクラスのテストの結果です
# 左から名前、算数のテストの点数、国語のテストの点数
# となっています

students_scores = [
['García',    58, 54],
['Fernández', 85,  4],
['González',  97, 19],
['Rodríguez', 77, 23],
['López',     19, 23],
['Martínez',  86, 82],
['Sánchez',   69, 54],
['Pérez',     53, 25],
['Martín',    44, 62],
['Gómez',     11, 63],
['Ruiz',       4, 45],
['Hernández', 91, 72],
['Jiménez',   64, 52],
['Díaz',      63, 77],
['Álvarez',   23, 36],
['Moreno',    83, 60],
['Muñoz',     94, 93],
['Alonso',     1, 67],
['Gutiérrez', 32,  8],
['Romero',    18, 96]
]

# 0. 1からnまでの整数の繰り返しを作る必要があるときは、以下の関数を使ってください
# range(n)
# 例)
# for x in range(4):
#    print(x)
# は、以下のように表示される
# 0
# 1
# 2
# 3

# 1. 30点以下の教科が赤点となる場合、赤点の生徒の名前をすべて列挙してください
# TODO

# 2. 算数の平均点、国語の平均点を求めてください
# TODO

# 3. 全員の生徒の合計点を求めてください
# TODO

# 4. 合計点120点以上が合格となる場合、合格の生徒の名前をすべて列挙してください
# TODO

# 5. 教科別に最高得点、最低得点を列挙してください
# TODO
