# 行頭に # を書くと、プログラムとして処理されない文字列（コメントと呼ばれます）を書くことができます

# 以下の例にならって、文字を表示してください
# ex. 1 == 1 の結果を表示する（値が同じであることを判定します）
print('2 == 1')
print(2 == 1)

# なお、実行結果に表示されるTrue, Falseとは
# True  ... Yes, はい, 真
# False ... No, いいえ, 偽
# の意味です

# 1. 2 != 1 の結果を表示する（値が同じでないことを判定します）
print('2 != 1')
print(2 != 1)
# 2. 2 > 1 の結果を表示する
print('2 > 1')
print(2 > 1)
# 3. 1 < 2 の結果を表示する
print('1 < 2')
print(1 < 2)
# 3. 1 >= 1 の結果を表示する
print('1 >= 1')
print(1 >= 1)
# 4. 1 <= 1 の結果を表示する
print('1 <= 1')
print(1 <= 1)
# 5. 1 *= '1' の結果を表示する（結果がFalseとなることに注目してください）
print("1 == '1'")
print(1 == '1')
# 6. 1 == True の結果を表示する（結果がTrueとなることに注目してください）
print('1 == True')
print(1 == True)
